.svn/pristine/fa/fa64fb408038ca2926fbd2aa79891946e265f4e6.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:fram="http://framework.facade.common.transcore.pinganfu.com/">
	<soapenv:Header />
	<soapenv:Body>
		<fram:execPayEngine>
			<arg0>
				<tranOrderId>00030003201409300000000002661662</tranOrderId>
				<businessDomain>bankCardFastPay</businessDomain>
				<tranType>12</tranType>
				<inRequestNo>W2014093000000001528701</inRequestNo>
				<requestSource>006</requestSource>
				 <payEngineItemDtoList>
				<accountTransCode>null</accountTransCode>
				<operationType>transfer</operationType>
				<fromEntity>ACCOUNT</fromEntity>
				<fromEntityId>0101010000000000003135</fromEntityId>
				<toEntity>DEFAULT</toEntity>
				<toEntityId>0101010000000000003124</toEntityId>
				<calcBase>CASH</calcBase>
				<calcBaseType>CNY</calcBaseType>
				<amount>1000000</amount>
               <accountInfoDto>
			   <productCode>100010020000</productCode>
			   </accountInfoDto>
			   </payEngineItemDtoList>
			</arg0>
		</fram:execPayEngine>
	</soapenv:Body>
</soapenv:Envelope>